MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GA410/mcu.h
extern volatile U3MODEBITS U3MODEbits __attribute__((__sfr__));

#define U3STA U3STA
extern volatile uint16_t U3STA __attribute__((__sfr__));
__extension__ typedef struct tagU3STABITS {
  union {
    struct {
      uint16_t URXDA:1;
      uint16_t OERR:1;
      uint16_t FERR:1;
      uint16_t PERR:1;
      uint16_t RIDLE:1;
      uint16_t ADDEN:1;
      uint16_t URXISEL:2;
      uint16_t TRMT:1;
      uint16_t UTXBF:1;
      uint16_t UTXEN:1;
      uint16_t UTXBRK:1;
      uint16_t URXEN:1;
      uint16_t UTXISEL0:1;
      uint16_t UTXINV:1;
      uint16_t UTXISEL1:1;
    };
    struct {
      uint16_t :6;
      uint16_t URXISEL0:1;
      uint16_t URXISEL1:1;
    };
  };
} U3STABITS;
extern volatile U3STABITS U3STAbits __attribute__((__sfr__));

#define U3TXREG U3TXREG
extern volatile uint16_t U3TXREG __attribute__((__sfr__));
typedef struct tagU3TXREGBITS {
  uint16_t :15;
  uint16_t LAST:1;
} U3TXREGBITS;
extern volatile U3TXREGBITS U3TXREGbits __attribute__((__sfr__));

#define U3RXREG U3RXREG
extern volatile uint16_t U3RXREG __attribute__((__sfr__));
#define U3BRG U3BRG
extern volatile uint16_t U3BRG __attribute__((__sfr__));
#define U3ADMD U3ADMD
extern volatile uint16_t U3ADMD __attribute__((__sfr__));
__extension__ typedef struct tagU3ADMDBITS {
  union {
    struct {
      uint16_t ADMADDR:8;
      uint16_t ADMMASK:8;
    };
    struct {
      uint16_t ADMADDR0:1;
      uint16_t ADMADDR1:1;
      uint16_t ADMADDR2:1;
      uint16_t ADMADDR3:1;
      uint16_t ADMADDR4:1;
      uint16_t ADMADDR5:1;
      uint16_t ADMADDR6:1;
      uint16_t ADMADDR7:1;
      uint16_t ADMMASK0:1;
      uint16_t ADMMASK1:1;
      uint16_t ADMMASK2:1;
      uint16_t ADMMASK3:1;
      uint16_t ADMMASK4:1;
      uint16_t ADMMASK5:1;
      uint16_t ADMMASK6:1;
      uint16_t ADMMASK7:1;
    };
  };
} U3ADMDBITS;
extern volatile U3ADMDBITS U3ADMDbits __attribute__((__sfr__));


#define UART4 UART4
extern volatile UART UART4 __attribute__((__sfr__));

#define U4MODE U4MODE
extern volatile uint16_t U4MODE __attribute__((__sfr__));
__extension__ typedef struct tagU4MODEBITS {
  union {
    struct {
      uint16_t STSEL:1;
      uint16_t PDSEL:2;
      uint16_t BRGH:1;
      uint16_t URXINV:1;
      uint16_t ABAUD:1;
      uint16_t LPBACK:1;
      uint16_t WAKE:1;
      uint16_t UEN:2;
      uint16_t :1;
      uint16_t RTSMD:1;
      uint16_t IREN:1;
      uint16_t USIDL:1;
      uint16_t :1;
      uint16_t UARTEN:1;
    };
    struct {
      uint16_t :1;
      uint16_t PDSEL0:1;
      uint16_t PDSEL1:1;
      uint16_t :1;
      uint16_t RXINV:1;
      uint16_t :3;
      uint16_t UEN0:1;
      uint16_t UEN1:1;
    };
  };
} U4MODEBITS;
extern volatile U4MODEBITS U4MODEbits __attribute__((__sfr__));

#define U4STA U4STA
extern volatile uint16_t U4STA __attribute__((__sfr__));
__extension__ typedef struct tagU4STABITS {
  union {
    struct {
      uint16_t URXDA:1;
      uint16_t OERR:1;
      uint16_t FERR:1;
      uint16_t PERR:1;
      uint16_t RIDLE:1;
      uint16_t ADDEN:1;
      uint16_t URXISEL:2;
      uint16_t TRMT:1;
      uint16_t UTXBF:1;
      uint16_t UTXEN:1;
      uint16_t UTXBRK:1;
      uint16_t URXEN:1;
      uint16_t UTXISEL0:1;
      uint16_t UTXINV:1;
      uint16_t UTXISEL1:1;
    };
    struct {
      uint16_t :6;
      uint16_t URXISEL0:1;
      uint16_t URXISEL1:1;
    };
  };
} U4STABITS;
extern volatile U4STABITS U4STAbits __attribute__((__sfr__));

#define U4TXREG U4TXREG
extern volatile uint16_t U4TXREG __attribute__((__sfr__));
typedef struct tagU4TXREGBITS {
  uint16_t :15;
  uint16_t LAST:1;
} U4TXREGBITS;
extern volatile U4TXREGBITS U4TXREGbits __attribute__((__sfr__));

#define U4RXREG U4RXREG
extern volatile uint16_t U4RXREG __attribute__((__sfr__));
#define U4BRG U4BRG
extern volatile uint16_t U4BRG __attribute__((__sfr__));
#define U4ADMD U4ADMD
extern volatile uint16_t U4ADMD __attribute__((__sfr__));
__extension__ typedef struct tagU4ADMDBITS {
  union {
    struct {
      uint16_t ADMADDR:8;
      uint16_t ADMMASK:8;
    };
    struct {
      uint16_t ADMADDR0:1;
      uint16_t ADMADDR1:1;
      uint16_t ADMADDR2:1;
      uint16_t ADMADDR3:1;
      uint16_t ADMADDR4:1;
      uint16_t ADMADDR5:1;
      uint16_t ADMADDR6:1;
      uint16_t ADMADDR7:1;
      uint16_t ADMMASK0:1;
      uint16_t ADMMASK1:1;
      uint16_t ADMMASK2:1;
      uint16_t ADMMASK3:1;
      uint16_t ADMMASK4:1;
      uint16_t ADMMASK5:1;
      uint16_t ADMMASK6:1;
      uint16_t ADMMASK7:1;
    };
  };
} U4ADMDBITS;
extern volatile U4ADMDBITS U4ADMDbits __attribute__((__sfr__));


#define UART5 UART5
extern volatile UART UART5 __attribute__((__sfr__));

#define U5MODE U5MODE
extern volatile uint16_t U5MODE __attribute__((__sfr__));
__extension__ typedef struct tagU5MODEBITS {
  union {
    struct {
      uint16_t STSEL:1;
      uint16_t PDSEL:2;
      uint16_t BRGH:1;
      uint16_t URXINV:1;
      uint16_t ABAUD:1;
      uint16_t LPBACK:1;
      uint16_t WAKE:1;
      uint16_t UEN:2;
      uint16_t :1;
      uint16_t RTSMD:1;
      uint16_t IREN:1;
      uint16_t USIDL:1;
      uint16_t :1;
      uint16_t UARTEN:1;
    };
    struct {
      uint16_t :1;
      uint16_t PDSEL0:1;
      uint16_t PDSEL1:1;
      uint16_t :1;
      uint16_t RXINV:1;
      uint16_t :3;
      uint16_t UEN0:1;
      uint16_t UEN1:1;
    };
  };
} U5MODEBITS;
extern volatile U5MODEBITS U5MODEbits __attribute__((__sfr__));

#define U5STA U5STA
extern volatile uint16_t U5STA __attribute__((__sfr__));
__extension__ typedef struct tagU5STABITS {
  union {
    struct {
      uint16_t URXDA:1;
      uint16_t OERR:1;
      uint16_t FERR:1;
      uint16_t PERR:1;
      uint16_t RIDLE:1;
      uint16_t ADDEN:1;
      uint16_t URXISEL:2;
      uint16_t TRMT:1;
      uint16_t UTXBF:1;
      uint16_t UTXEN:1;
      uint16_t UTXBRK:1;
      uint16_t URXEN:1;
      uint16_t UTXISEL0:1;
      uint16_t UTXINV:1;
      uint16_t UTXISEL1:1;
    };
    struct {
      uint16_t :6;
      uint16_t URXISEL0:1;
      uint16_t URXISEL1:1;
    };
  };
} U5STABITS;
extern volatile U5STABITS U5STAbits __attribute__((__sfr__));

#define U5TXREG U5TXREG
extern volatile uint16_t U5TXREG __attribute__((__sfr__));
typedef struct tagU5TXREGBITS {
  uint16_t :15;
  uint16_t LAST:1;
} U5TXREGBITS;
extern volatile U5TXREGBITS U5TXREGbits __attribute__((__sfr__));

#define U5RXREG U5RXREG
extern volatile uint16_t U5RXREG __attribute__((__sfr__));
#define U5BRG U5BRG
extern volatile uint16_t U5BRG __attribute__((__sfr__));
#define U5ADMD U5ADMD
extern volatile uint16_t U5ADMD __attribute__((__sfr__));
__extension__ typedef struct tagU5ADMDBITS {
  union {
    struct {
      uint16_t ADMADDR:8;
      uint16_t ADMMASK:8;
    };
    struct {
      uint16_t ADMADDR0:1;
      uint16_t ADMADDR1:1;
      uint16_t ADMADDR2:1;
      uint16_t ADMADDR3:1;
      uint16_t ADMADDR4:1;
      uint16_t ADMADDR5:1;
      uint16_t ADMADDR6:1;
      uint16_t ADMADDR7:1;
      uint16_t ADMMASK0:1;
      uint16_t ADMMASK1:1;
      uint16_t ADMMASK2:1;
      uint16_t ADMMASK3:1;
      uint16_t ADMMASK4:1;
      uint16_t ADMMASK5:1;
      uint16_t ADMMASK6:1;
      uint16_t ADMMASK7:1;
    };
  };
} U5ADMDBITS;
extern volatile U5ADMDBITS U5ADMDbits __attribute__((__sfr__));


#define UART6 UART6
extern volatile UART UART6 __attribute__((__sfr__));

