MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GA410/mcu.h
#define PORTH PORTH
extern volatile uint16_t PORTH __attribute__((__sfr__));
typedef struct tagPORTHBITS {
  uint16_t RH0:1;
  uint16_t RH1:1;
  uint16_t RH2:1;
  uint16_t RH3:1;
  uint16_t RH4:1;
  uint16_t RH5:1;
  uint16_t RH6:1;
  uint16_t RH7:1;
  uint16_t RH8:1;
  uint16_t RH9:1;
  uint16_t RH10:1;
  uint16_t RH11:1;
  uint16_t RH12:1;
  uint16_t RH13:1;
  uint16_t RH14:1;
  uint16_t RH15:1;
} PORTHBITS;
extern volatile PORTHBITS PORTHbits __attribute__((__sfr__));

#define LATH LATH
extern volatile uint16_t LATH __attribute__((__sfr__));
typedef struct tagLATHBITS {
  uint16_t LATH0:1;
  uint16_t LATH1:1;
  uint16_t LATH2:1;
  uint16_t LATH3:1;
  uint16_t LATH4:1;
  uint16_t LATH5:1;
  uint16_t LATH6:1;
  uint16_t LATH7:1;
  uint16_t LATH8:1;
  uint16_t LATH9:1;
  uint16_t LATH10:1;
  uint16_t LATH11:1;
  uint16_t LATH12:1;
  uint16_t LATH13:1;
  uint16_t LATH14:1;
  uint16_t LATH15:1;
} LATHBITS;
extern volatile LATHBITS LATHbits __attribute__((__sfr__));

#define ODCH ODCH
extern volatile uint16_t ODCH __attribute__((__sfr__));
typedef struct tagODCHBITS {
  uint16_t ODCH0:1;
  uint16_t ODCH1:1;
  uint16_t ODCH2:1;
  uint16_t ODCH3:1;
  uint16_t ODCH4:1;
  uint16_t ODCH5:1;
  uint16_t ODCH6:1;
  uint16_t ODCH7:1;
  uint16_t ODCH8:1;
  uint16_t ODCH9:1;
  uint16_t ODCH10:1;
  uint16_t ODCH11:1;
  uint16_t ODCH12:1;
  uint16_t ODCH13:1;
  uint16_t ODCH14:1;
  uint16_t ODCH15:1;
} ODCHBITS;
extern volatile ODCHBITS ODCHbits __attribute__((__sfr__));

#define ANSELH ANSELH
extern volatile uint16_t ANSELH __attribute__((__sfr__));
__extension__ typedef struct tagANSELHBITS {
  union {
    struct {
      uint16_t ANSH0:1;
      uint16_t ANSH1:1;
      uint16_t ANSH2:1;
      uint16_t ANSH3:1;
      uint16_t ANSH4:1;
    };
    struct {
      uint16_t ANSELH0:1;
      uint16_t ANSELH1:1;
      uint16_t ANSELH2:1;
      uint16_t ANSELH3:1;
      uint16_t ANSELH4:1;
    };
  };
} ANSELHBITS;
extern volatile ANSELHBITS ANSELHbits __attribute__((__sfr__));

#define ANSH ANSH
extern volatile uint16_t ANSH __attribute__((__sfr__));
__extension__ typedef struct tagANSHBITS {
  union {
    struct {
      uint16_t ANSH0:1;
      uint16_t ANSH1:1;
      uint16_t ANSH2:1;
      uint16_t ANSH3:1;
      uint16_t ANSH4:1;
    };
    struct {
      uint16_t ANSELH0:1;
      uint16_t ANSELH1:1;
      uint16_t ANSELH2:1;
      uint16_t ANSELH3:1;
      uint16_t ANSELH4:1;
    };
  };
} ANSHBITS;
extern volatile ANSHBITS ANSHbits __attribute__((__sfr__));

#define IOCPH IOCPH
extern volatile uint16_t IOCPH __attribute__((__sfr__));
typedef struct tagIOCPHBITS {
  uint16_t IOCPH0:1;
  uint16_t IOCPH1:1;
  uint16_t IOCPH2:1;
  uint16_t IOCPH3:1;
  uint16_t IOCPH4:1;
  uint16_t IOCPH5:1;
  uint16_t IOCPH6:1;
  uint16_t IOCPH7:1;
  uint16_t IOCPH8:1;
  uint16_t IOCPH9:1;
  uint16_t IOCPH10:1;
  uint16_t IOCPH11:1;
  uint16_t IOCPH12:1;
  uint16_t IOCPH13:1;
  uint16_t IOCPH14:1;
  uint16_t IOCPH15:1;
} IOCPHBITS;
extern volatile IOCPHBITS IOCPHbits __attribute__((__sfr__));

#define IOCNH IOCNH
extern volatile uint16_t IOCNH __attribute__((__sfr__));
typedef struct tagIOCNHBITS {
  uint16_t IOCNH0:1;
  uint16_t IOCNH1:1;
  uint16_t IOCNH2:1;
  uint16_t IOCNH3:1;
  uint16_t IOCNH4:1;
  uint16_t IOCNH5:1;
  uint16_t IOCNH6:1;
  uint16_t IOCNH7:1;
  uint16_t IOCNH8:1;
  uint16_t IOCNH9:1;
  uint16_t IOCNH10:1;
  uint16_t IOCNH11:1;
  uint16_t IOCNH12:1;
  uint16_t IOCNH13:1;
  uint16_t IOCNH14:1;
  uint16_t IOCNH15:1;
} IOCNHBITS;
extern volatile IOCNHBITS IOCNHbits __attribute__((__sfr__));

#define IOCFH IOCFH
extern volatile uint16_t IOCFH __attribute__((__sfr__));
typedef struct tagIOCFHBITS {
  uint16_t IOCFH0:1;
  uint16_t IOCFH1:1;
  uint16_t IOCFH2:1;
  uint16_t IOCFH3:1;
  uint16_t IOCFH4:1;
  uint16_t IOCFH5:1;
  uint16_t IOCFH6:1;
  uint16_t IOCFH7:1;
  uint16_t IOCFH8:1;
  uint16_t IOCFH9:1;
  uint16_t IOCFH10:1;
  uint16_t IOCFH11:1;
  uint16_t IOCFH12:1;
  uint16_t IOCFH13:1;
  uint16_t IOCFH14:1;
  uint16_t IOCFH15:1;
} IOCFHBITS;
extern volatile IOCFHBITS IOCFHbits __attribute__((__sfr__));

#define CNPUH CNPUH
extern volatile uint16_t CNPUH __attribute__((__sfr__));
__extension__ typedef struct tagCNPUHBITS {
  union {
    struct {
      uint16_t IOCPH0:1;
      uint16_t IOCPH1:1;
      uint16_t IOCPH2:1;
      uint16_t IOCPH3:1;
      uint16_t IOCPH4:1;
      uint16_t IOCPH5:1;
      uint16_t IOCPH6:1;
      uint16_t IOCPH7:1;
      uint16_t IOCPH8:1;
      uint16_t IOCPH9:1;
      uint16_t IOCPH10:1;
      uint16_t IOCPH11:1;
      uint16_t IOCPH12:1;
      uint16_t IOCPH13:1;
      uint16_t IOCPH14:1;
      uint16_t IOCPH15:1;
    };
    struct {
      uint16_t IOCPUH0:1;
      uint16_t IOCPUH1:1;
      uint16_t IOCPUH2:1;
      uint16_t IOCPUH3:1;
      uint16_t IOCPUH4:1;
      uint16_t IOCPUH5:1;
      uint16_t IOCPUH6:1;
      uint16_t IOCPUH7:1;
      uint16_t IOCPUH8:1;
      uint16_t IOCPUH9:1;
      uint16_t IOCPUH10:1;
      uint16_t IOCPUH11:1;
      uint16_t IOCPUH12:1;
      uint16_t IOCPUH13:1;
      uint16_t IOCPUH14:1;
      uint16_t IOCPUH15:1;
    };
    struct {
      uint16_t CNPUH0:1;
      uint16_t CNPUH1:1;
      uint16_t CNPUH2:1;
      uint16_t CNPUH3:1;
      uint16_t CNPUH4:1;
      uint16_t CNPUH5:1;
      uint16_t CNPUH6:1;
      uint16_t CNPUH7:1;
      uint16_t CNPUH8:1;
      uint16_t CNPUH9:1;
      uint16_t CNPUH10:1;
      uint16_t CNPUH11:1;
      uint16_t CNPUH12:1;
      uint16_t CNPUH13:1;
      uint16_t CNPUH14:1;
      uint16_t CNPUH15:1;
    };
  };
} CNPUHBITS;
extern volatile CNPUHBITS CNPUHbits __attribute__((__sfr__));

#define IOCPUH IOCPUH
extern volatile uint16_t IOCPUH __attribute__((__sfr__));
__extension__ typedef struct tagIOCPUHBITS {
  union {
    struct {
      uint16_t IOCPH0:1;
      uint16_t IOCPH1:1;
      uint16_t IOCPH2:1;
      uint16_t IOCPH3:1;
      uint16_t IOCPH4:1;
      uint16_t IOCPH5:1;
      uint16_t IOCPH6:1;
      uint16_t IOCPH7:1;
      uint16_t IOCPH8:1;
      uint16_t IOCPH9:1;
      uint16_t IOCPH10:1;
      uint16_t IOCPH11:1;
      uint16_t IOCPH12:1;
      uint16_t IOCPH13:1;
      uint16_t IOCPH14:1;
      uint16_t IOCPH15:1;
    };
    struct {
      uint16_t IOCPUH0:1;
      uint16_t IOCPUH1:1;
      uint16_t IOCPUH2:1;
      uint16_t IOCPUH3:1;
      uint16_t IOCPUH4:1;
      uint16_t IOCPUH5:1;
      uint16_t IOCPUH6:1;
      uint16_t IOCPUH7:1;
      uint16_t IOCPUH8:1;
      uint16_t IOCPUH9:1;
      uint16_t IOCPUH10:1;
      uint16_t IOCPUH11:1;
      uint16_t IOCPUH12:1;
      uint16_t IOCPUH13:1;
      uint16_t IOCPUH14:1;
      uint16_t IOCPUH15:1;
    };
    struct {
      uint16_t CNPUH0:1;
      uint16_t CNPUH1:1;
      uint16_t CNPUH2:1;
      uint16_t CNPUH3:1;
      uint16_t CNPUH4:1;
      uint16_t CNPUH5:1;
      uint16_t CNPUH6:1;
      uint16_t CNPUH7:1;
      uint16_t CNPUH8:1;
      uint16_t CNPUH9:1;
      uint16_t CNPUH10:1;
      uint16_t CNPUH11:1;
      uint16_t CNPUH12:1;
      uint16_t CNPUH13:1;
      uint16_t CNPUH14:1;
      uint16_t CNPUH15:1;
    };
  };
} IOCPUHBITS;
extern volatile IOCPUHBITS IOCPUHbits __attribute__((__sfr__));

#define CNPDH CNPDH
extern volatile uint16_t CNPDH __attribute__((__sfr__));
__extension__ typedef struct tagCNPDHBITS {
  union {
    struct {
      uint16_t IOCPDH0:1;
      uint16_t IOCPDH1:1;
      uint16_t IOCPDH2:1;
      uint16_t IOCPDH3:1;
      uint16_t IOCPDH4:1;
      uint16_t IOCPDH5:1;
      uint16_t IOCPDH6:1;
      uint16_t IOCPDH7:1;
      uint16_t IOCPDH8:1;
      uint16_t IOCPDH9:1;
      uint16_t IOCPDH10:1;
      uint16_t IOCPDH11:1;
      uint16_t IOCPDH12:1;
      uint16_t IOCPDH13:1;
      uint16_t IOCPDH14:1;
      uint16_t IOCPDH15:1;
    };
    struct {
      uint16_t CNPDH0:1;
      uint16_t CNPDH1:1;
      uint16_t CNPDH2:1;
      uint16_t CNPDH3:1;
      uint16_t CNPDH4:1;
      uint16_t CNPDH5:1;
      uint16_t CNPDH6:1;
      uint16_t CNPDH7:1;
      uint16_t CNPDH8:1;
      uint16_t CNPDH9:1;
      uint16_t CNPDH10:1;
      uint16_t CNPDH11:1;
      uint16_t CNPDH12:1;
      uint16_t CNPDH13:1;
      uint16_t CNPDH14:1;
      uint16_t CNPDH15:1;
    };
  };
} CNPDHBITS;
extern volatile CNPDHBITS CNPDHbits __attribute__((__sfr__));

#define IOCPDH IOCPDH
extern volatile uint16_t IOCPDH __attribute__((__sfr__));
__extension__ typedef struct tagIOCPDHBITS {
  union {
    struct {
      uint16_t IOCPDH0:1;
      uint16_t IOCPDH1:1;
      uint16_t IOCPDH2:1;
      uint16_t IOCPDH3:1;
      uint16_t IOCPDH4:1;
      uint16_t IOCPDH5:1;
      uint16_t IOCPDH6:1;
      uint16_t IOCPDH7:1;
      uint16_t IOCPDH8:1;
      uint16_t IOCPDH9:1;
      uint16_t IOCPDH10:1;
      uint16_t IOCPDH11:1;
      uint16_t IOCPDH12:1;
      uint16_t IOCPDH13:1;
      uint16_t IOCPDH14:1;
      uint16_t IOCPDH15:1;
    };
    struct {
      uint16_t CNPDH0:1;
      uint16_t CNPDH1:1;
      uint16_t CNPDH2:1;
      uint16_t CNPDH3:1;
      uint16_t CNPDH4:1;
      uint16_t CNPDH5:1;
      uint16_t CNPDH6:1;
      uint16_t CNPDH7:1;
      uint16_t CNPDH8:1;
      uint16_t CNPDH9:1;
      uint16_t CNPDH10:1;
      uint16_t CNPDH11:1;
      uint16_t CNPDH12:1;
      uint16_t CNPDH13:1;
      uint16_t CNPDH14:1;
      uint16_t CNPDH15:1;
    };
  };
} IOCPDHBITS;
