MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GA410/mcu.h
/* LCDSE3 */
#define _SE48 LCDSE3bits.SE48
#define _SE49 LCDSE3bits.SE49
#define _SE50 LCDSE3bits.SE50
#define _SE51 LCDSE3bits.SE51
#define _SE52 LCDSE3bits.SE52
#define _SE53 LCDSE3bits.SE53
#define _SE54 LCDSE3bits.SE54
#define _SE55 LCDSE3bits.SE55
#define _SE56 LCDSE3bits.SE56
#define _SE57 LCDSE3bits.SE57
#define _SE58 LCDSE3bits.SE58
#define _SE59 LCDSE3bits.SE59
#define _SE60 LCDSE3bits.SE60
#define _SE61 LCDSE3bits.SE61
#define _SE62 LCDSE3bits.SE62
#define _SE63 LCDSE3bits.SE63

/* LCDREG */
/* Bitname _CLKSEL cannot be defined because it is used by more than one SFR */
#define _CPEN LCDREGbits.CPEN

/* PADCON */
#define _PMPTTL PADCONbits.PMPTTL
#define _IOCON PADCONbits.IOCON

/* IOCSTAT */
#define _IOCPAF IOCSTATbits.IOCPAF
#define _IOCPBF IOCSTATbits.IOCPBF
#define _IOCPCF IOCSTATbits.IOCPCF
#define _IOCPDF IOCSTATbits.IOCPDF
#define _IOCPEF IOCSTATbits.IOCPEF
#define _IOCPFF IOCSTATbits.IOCPFF
#define _IOCPGF IOCSTATbits.IOCPGF
#define _IOCPHF IOCSTATbits.IOCPHF
#define _IOCPJF IOCSTATbits.IOCPJF

/* TRISA */
#define _TRISA0 TRISAbits.TRISA0
#define _TRISA1 TRISAbits.TRISA1
#define _TRISA2 TRISAbits.TRISA2
#define _TRISA3 TRISAbits.TRISA3
#define _TRISA4 TRISAbits.TRISA4
#define _TRISA5 TRISAbits.TRISA5
#define _TRISA6 TRISAbits.TRISA6
#define _TRISA7 TRISAbits.TRISA7
#define _TRISA9 TRISAbits.TRISA9
#define _TRISA10 TRISAbits.TRISA10
#define _TRISA14 TRISAbits.TRISA14
#define _TRISA15 TRISAbits.TRISA15

/* PORTA */
#define _RA0 PORTAbits.RA0
#define _RA1 PORTAbits.RA1
#define _RA2 PORTAbits.RA2
#define _RA3 PORTAbits.RA3
#define _RA4 PORTAbits.RA4
#define _RA5 PORTAbits.RA5
#define _RA6 PORTAbits.RA6
#define _RA7 PORTAbits.RA7
#define _RA9 PORTAbits.RA9
#define _RA10 PORTAbits.RA10
#define _RA14 PORTAbits.RA14
#define _RA15 PORTAbits.RA15

/* LATA */
#define _LATA0 LATAbits.LATA0
#define _LATA1 LATAbits.LATA1
#define _LATA2 LATAbits.LATA2
#define _LATA3 LATAbits.LATA3
#define _LATA4 LATAbits.LATA4
#define _LATA5 LATAbits.LATA5
#define _LATA6 LATAbits.LATA6
#define _LATA7 LATAbits.LATA7
#define _LATA9 LATAbits.LATA9
#define _LATA10 LATAbits.LATA10
#define _LATA14 LATAbits.LATA14
#define _LATA15 LATAbits.LATA15

/* ODCA */
#define _ODCA0 ODCAbits.ODCA0
#define _ODCA1 ODCAbits.ODCA1
#define _ODCA2 ODCAbits.ODCA2
#define _ODCA3 ODCAbits.ODCA3
#define _ODCA4 ODCAbits.ODCA4
#define _ODCA5 ODCAbits.ODCA5
#define _ODCA6 ODCAbits.ODCA6
#define _ODCA7 ODCAbits.ODCA7
#define _ODCA9 ODCAbits.ODCA9
#define _ODCA10 ODCAbits.ODCA10
#define _ODCA14 ODCAbits.ODCA14
#define _ODCA15 ODCAbits.ODCA15

/* ANSA */
#define _ANSA0 ANSAbits.ANSA0
#define _ANSA2 ANSAbits.ANSA2
#define _ANSA3 ANSAbits.ANSA3
#define _ANSA5 ANSAbits.ANSA5
#define _ANSA6 ANSAbits.ANSA6
#define _ANSA7 ANSAbits.ANSA7
#define _ANSA9 ANSAbits.ANSA9
#define _ANSA10 ANSAbits.ANSA10
#define _ANSA14 ANSAbits.ANSA14
#define _ANSA15 ANSAbits.ANSA15
#define _ANSELA0 ANSAbits.ANSELA0
#define _ANSELA2 ANSAbits.ANSELA2
#define _ANSELA3 ANSAbits.ANSELA3
#define _ANSELA5 ANSAbits.ANSELA5
#define _ANSELA6 ANSAbits.ANSELA6
#define _ANSELA7 ANSAbits.ANSELA7
#define _ANSELA9 ANSAbits.ANSELA9
#define _ANSELA10 ANSAbits.ANSELA10
#define _ANSELA14 ANSAbits.ANSELA14
#define _ANSELA15 ANSAbits.ANSELA15

/* IOCPA */
/* Bitname _IOCPA0 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPA1 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPA2 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPA3 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPA4 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPA5 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPA6 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPA7 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPA9 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPA10 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPA14 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPA15 cannot be defined because it is used by more than one SFR */

/* IOCNA */
#define _IOCNA0 IOCNAbits.IOCNA0
#define _IOCNA1 IOCNAbits.IOCNA1
#define _IOCNA2 IOCNAbits.IOCNA2
#define _IOCNA3 IOCNAbits.IOCNA3
#define _IOCNA4 IOCNAbits.IOCNA4
#define _IOCNA5 IOCNAbits.IOCNA5
#define _IOCNA6 IOCNAbits.IOCNA6
#define _IOCNA7 IOCNAbits.IOCNA7
#define _IOCNA9 IOCNAbits.IOCNA9
#define _IOCNA10 IOCNAbits.IOCNA10
#define _IOCNA14 IOCNAbits.IOCNA14
#define _IOCNA15 IOCNAbits.IOCNA15

/* IOCFA */
#define _IOCFA0 IOCFAbits.IOCFA0
#define _IOCFA1 IOCFAbits.IOCFA1
#define _IOCFA2 IOCFAbits.IOCFA2
#define _IOCFA3 IOCFAbits.IOCFA3
#define _IOCFA4 IOCFAbits.IOCFA4
#define _IOCFA5 IOCFAbits.IOCFA5
#define _IOCFA6 IOCFAbits.IOCFA6
#define _IOCFA7 IOCFAbits.IOCFA7
#define _IOCFA9 IOCFAbits.IOCFA9
#define _IOCFA10 IOCFAbits.IOCFA10
#define _IOCFA14 IOCFAbits.IOCFA14
#define _IOCFA15 IOCFAbits.IOCFA15

/* CNPUA */
/* Bitname _IOCPA0 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPA1 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPA2 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPA3 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPA4 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPA5 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPA6 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPA7 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPA9 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPA10 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPA14 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPA15 cannot be defined because it is used by more than one SFR */
#define _IOCPUA0 CNPUAbits.IOCPUA0
#define _IOCPUA1 CNPUAbits.IOCPUA1
#define _IOCPUA2 CNPUAbits.IOCPUA2
#define _IOCPUA3 CNPUAbits.IOCPUA3
#define _IOCPUA4 CNPUAbits.IOCPUA4
#define _IOCPUA5 CNPUAbits.IOCPUA5
#define _IOCPUA6 CNPUAbits.IOCPUA6
#define _IOCPUA7 CNPUAbits.IOCPUA7
#define _IOCPUA9 CNPUAbits.IOCPUA9
#define _IOCPUA10 CNPUAbits.IOCPUA10
#define _IOCPUA14 CNPUAbits.IOCPUA14
#define _IOCPUA15 CNPUAbits.IOCPUA15
#define _CNPUA0 CNPUAbits.CNPUA0
#define _CNPUA1 CNPUAbits.CNPUA1
#define _CNPUA2 CNPUAbits.CNPUA2
#define _CNPUA3 CNPUAbits.CNPUA3
#define _CNPUA4 CNPUAbits.CNPUA4
#define _CNPUA5 CNPUAbits.CNPUA5
#define _CNPUA6 CNPUAbits.CNPUA6
#define _CNPUA7 CNPUAbits.CNPUA7
#define _CNPUA9 CNPUAbits.CNPUA9
#define _CNPUA10 CNPUAbits.CNPUA10
#define _CNPUA14 CNPUAbits.CNPUA14
#define _CNPUA15 CNPUAbits.CNPUA15

/* CNPDA */
#define _IOCPDA0 CNPDAbits.IOCPDA0
#define _IOCPDA1 CNPDAbits.IOCPDA1
#define _IOCPDA2 CNPDAbits.IOCPDA2
#define _IOCPDA3 CNPDAbits.IOCPDA3
#define _IOCPDA4 CNPDAbits.IOCPDA4
#define _IOCPDA5 CNPDAbits.IOCPDA5
#define _IOCPDA6 CNPDAbits.IOCPDA6
#define _IOCPDA7 CNPDAbits.IOCPDA7
#define _IOCPDA9 CNPDAbits.IOCPDA9
#define _IOCPDA10 CNPDAbits.IOCPDA10
#define _IOCPDA14 CNPDAbits.IOCPDA14
#define _IOCPDA15 CNPDAbits.IOCPDA15
#define _CNPDA0 CNPDAbits.CNPDA0
#define _CNPDA1 CNPDAbits.CNPDA1
#define _CNPDA2 CNPDAbits.CNPDA2
#define _CNPDA3 CNPDAbits.CNPDA3
#define _CNPDA4 CNPDAbits.CNPDA4
#define _CNPDA5 CNPDAbits.CNPDA5
#define _CNPDA6 CNPDAbits.CNPDA6
#define _CNPDA7 CNPDAbits.CNPDA7
#define _CNPDA9 CNPDAbits.CNPDA9
#define _CNPDA10 CNPDAbits.CNPDA10
#define _CNPDA14 CNPDAbits.CNPDA14
#define _CNPDA15 CNPDAbits.CNPDA15

/* TRISB */
#define _TRISB0 TRISBbits.TRISB0
#define _TRISB1 TRISBbits.TRISB1
#define _TRISB2 TRISBbits.TRISB2
#define _TRISB3 TRISBbits.TRISB3
#define _TRISB4 TRISBbits.TRISB4
#define _TRISB5 TRISBbits.TRISB5
#define _TRISB6 TRISBbits.TRISB6
#define _TRISB7 TRISBbits.TRISB7
#define _TRISB8 TRISBbits.TRISB8
#define _TRISB9 TRISBbits.TRISB9
#define _TRISB10 TRISBbits.TRISB10
#define _TRISB11 TRISBbits.TRISB11
#define _TRISB12 TRISBbits.TRISB12
#define _TRISB13 TRISBbits.TRISB13
#define _TRISB14 TRISBbits.TRISB14
#define _TRISB15 TRISBbits.TRISB15

/* PORTB */
#define _RB0 PORTBbits.RB0
#define _RB1 PORTBbits.RB1
#define _RB2 PORTBbits.RB2
#define _RB3 PORTBbits.RB3
#define _RB4 PORTBbits.RB4
#define _RB5 PORTBbits.RB5
#define _RB6 PORTBbits.RB6
#define _RB7 PORTBbits.RB7
#define _RB8 PORTBbits.RB8
#define _RB9 PORTBbits.RB9
#define _RB10 PORTBbits.RB10
#define _RB11 PORTBbits.RB11
#define _RB12 PORTBbits.RB12
#define _RB13 PORTBbits.RB13
#define _RB14 PORTBbits.RB14
#define _RB15 PORTBbits.RB15

