MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GA410/mcu.h
#define _CCP5CON2L_ASDG0_POSITION                0x00000000
#define _CCP5CON2L_ASDG0_MASK                    0x00000001
#define _CCP5CON2L_ASDG0_LENGTH                  0x00000001

#define _CCP5CON2L_ASDG1_POSITION                0x00000001
#define _CCP5CON2L_ASDG1_MASK                    0x00000002
#define _CCP5CON2L_ASDG1_LENGTH                  0x00000001

#define _CCP5CON2L_ASDG2_POSITION                0x00000002
#define _CCP5CON2L_ASDG2_MASK                    0x00000004
#define _CCP5CON2L_ASDG2_LENGTH                  0x00000001

#define _CCP5CON2L_ASDG3_POSITION                0x00000003
#define _CCP5CON2L_ASDG3_MASK                    0x00000008
#define _CCP5CON2L_ASDG3_LENGTH                  0x00000001

#define _CCP5CON2L_ASDG4_POSITION                0x00000004
#define _CCP5CON2L_ASDG4_MASK                    0x00000010
#define _CCP5CON2L_ASDG4_LENGTH                  0x00000001

#define _CCP5CON2L_ASDG5_POSITION                0x00000005
#define _CCP5CON2L_ASDG5_MASK                    0x00000020
#define _CCP5CON2L_ASDG5_LENGTH                  0x00000001

#define _CCP5CON2L_ASDG6_POSITION                0x00000006
#define _CCP5CON2L_ASDG6_MASK                    0x00000040
#define _CCP5CON2L_ASDG6_LENGTH                  0x00000001

#define _CCP5CON2L_ASDG7_POSITION                0x00000007
#define _CCP5CON2L_ASDG7_MASK                    0x00000080
#define _CCP5CON2L_ASDG7_LENGTH                  0x00000001

#define _CCP5CON2H_ICS_POSITION                  0x00000000
#define _CCP5CON2H_ICS_MASK                      0x00000007
#define _CCP5CON2H_ICS_LENGTH                    0x00000003

#define _CCP5CON2H_AUXOUT_POSITION               0x00000003
#define _CCP5CON2H_AUXOUT_MASK                   0x00000018
#define _CCP5CON2H_AUXOUT_LENGTH                 0x00000002

#define _CCP5CON2H_ICGSM_POSITION                0x00000006
#define _CCP5CON2H_ICGSM_MASK                    0x000000C0
#define _CCP5CON2H_ICGSM_LENGTH                  0x00000002

#define _CCP5CON2H_OCAEN_POSITION                0x00000008
#define _CCP5CON2H_OCAEN_MASK                    0x00000100
#define _CCP5CON2H_OCAEN_LENGTH                  0x00000001

#define _CCP5CON2H_OENSYNC_POSITION              0x0000000F
#define _CCP5CON2H_OENSYNC_MASK                  0x00008000
#define _CCP5CON2H_OENSYNC_LENGTH                0x00000001

#define _CCP5CON2H_ICS0_POSITION                 0x00000000
#define _CCP5CON2H_ICS0_MASK                     0x00000001
#define _CCP5CON2H_ICS0_LENGTH                   0x00000001

#define _CCP5CON2H_ICS1_POSITION                 0x00000001
#define _CCP5CON2H_ICS1_MASK                     0x00000002
#define _CCP5CON2H_ICS1_LENGTH                   0x00000001

#define _CCP5CON2H_ICS2_POSITION                 0x00000002
#define _CCP5CON2H_ICS2_MASK                     0x00000004
#define _CCP5CON2H_ICS2_LENGTH                   0x00000001

#define _CCP5CON2H_AUXOUT0_POSITION              0x00000003
#define _CCP5CON2H_AUXOUT0_MASK                  0x00000008
#define _CCP5CON2H_AUXOUT0_LENGTH                0x00000001

#define _CCP5CON2H_AUXOUT1_POSITION              0x00000004
#define _CCP5CON2H_AUXOUT1_MASK                  0x00000010
#define _CCP5CON2H_AUXOUT1_LENGTH                0x00000001

#define _CCP5CON2H_ICGSM0_POSITION               0x00000006
#define _CCP5CON2H_ICGSM0_MASK                   0x00000040
#define _CCP5CON2H_ICGSM0_LENGTH                 0x00000001

#define _CCP5CON2H_ICGSM1_POSITION               0x00000007
#define _CCP5CON2H_ICGSM1_MASK                   0x00000080
#define _CCP5CON2H_ICGSM1_LENGTH                 0x00000001

#define _CCP5CON2H_ICSEL_POSITION                0x00000000
#define _CCP5CON2H_ICSEL_MASK                    0x00000007
#define _CCP5CON2H_ICSEL_LENGTH                  0x00000003

#define _CCP5CON2H_ICSEL0_POSITION               0x00000000
#define _CCP5CON2H_ICSEL0_MASK                   0x00000001
#define _CCP5CON2H_ICSEL0_LENGTH                 0x00000001

#define _CCP5CON2H_ICSEL1_POSITION               0x00000001
#define _CCP5CON2H_ICSEL1_MASK                   0x00000002
#define _CCP5CON2H_ICSEL1_LENGTH                 0x00000001

#define _CCP5CON2H_ICSEL2_POSITION               0x00000002
#define _CCP5CON2H_ICSEL2_MASK                   0x00000004
#define _CCP5CON2H_ICSEL2_LENGTH                 0x00000001

#define _CCP5CON3L_DT_POSITION                   0x00000000
#define _CCP5CON3L_DT_MASK                       0x0000003F
#define _CCP5CON3L_DT_LENGTH                     0x00000006

#define _CCP5CON3L_DT0_POSITION                  0x00000000
#define _CCP5CON3L_DT0_MASK                      0x00000001
#define _CCP5CON3L_DT0_LENGTH                    0x00000001

#define _CCP5CON3L_DT1_POSITION                  0x00000001
#define _CCP5CON3L_DT1_MASK                      0x00000002
#define _CCP5CON3L_DT1_LENGTH                    0x00000001

#define _CCP5CON3L_DT2_POSITION                  0x00000002
#define _CCP5CON3L_DT2_MASK                      0x00000004
#define _CCP5CON3L_DT2_LENGTH                    0x00000001

#define _CCP5CON3L_DT3_POSITION                  0x00000003
#define _CCP5CON3L_DT3_MASK                      0x00000008
#define _CCP5CON3L_DT3_LENGTH                    0x00000001

#define _CCP5CON3L_DT4_POSITION                  0x00000004
#define _CCP5CON3L_DT4_MASK                      0x00000010
#define _CCP5CON3L_DT4_LENGTH                    0x00000001

#define _CCP5CON3L_DT5_POSITION                  0x00000005
#define _CCP5CON3L_DT5_MASK                      0x00000020
#define _CCP5CON3L_DT5_LENGTH                    0x00000001

#define _CCP5CON3H_PSSACE_POSITION               0x00000002
#define _CCP5CON3H_PSSACE_MASK                   0x0000000C
#define _CCP5CON3H_PSSACE_LENGTH                 0x00000002

#define _CCP5CON3H_POLACE_POSITION               0x00000005
#define _CCP5CON3H_POLACE_MASK                   0x00000020
#define _CCP5CON3H_POLACE_LENGTH                 0x00000001

#define _CCP5CON3H_OUTM_POSITION                 0x00000008
#define _CCP5CON3H_OUTM_MASK                     0x00000700
#define _CCP5CON3H_OUTM_LENGTH                   0x00000003

