MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GA410/mcu.h
#define _LCDDATA2_S43C0_POSITION                 0x0000000B
#define _LCDDATA2_S43C0_MASK                     0x00000800
#define _LCDDATA2_S43C0_LENGTH                   0x00000001

#define _LCDDATA2_S44C0_POSITION                 0x0000000C
#define _LCDDATA2_S44C0_MASK                     0x00001000
#define _LCDDATA2_S44C0_LENGTH                   0x00000001

#define _LCDDATA2_S45C0_POSITION                 0x0000000D
#define _LCDDATA2_S45C0_MASK                     0x00002000
#define _LCDDATA2_S45C0_LENGTH                   0x00000001

#define _LCDDATA2_S46C0_POSITION                 0x0000000E
#define _LCDDATA2_S46C0_MASK                     0x00004000
#define _LCDDATA2_S46C0_LENGTH                   0x00000001

#define _LCDDATA2_S47C0_POSITION                 0x0000000F
#define _LCDDATA2_S47C0_MASK                     0x00008000
#define _LCDDATA2_S47C0_LENGTH                   0x00000001

#define _LCDDATA3_S48C0_POSITION                 0x00000000
#define _LCDDATA3_S48C0_MASK                     0x00000001
#define _LCDDATA3_S48C0_LENGTH                   0x00000001

#define _LCDDATA3_S49C0_POSITION                 0x00000001
#define _LCDDATA3_S49C0_MASK                     0x00000002
#define _LCDDATA3_S49C0_LENGTH                   0x00000001

#define _LCDDATA3_S50C0_POSITION                 0x00000002
#define _LCDDATA3_S50C0_MASK                     0x00000004
#define _LCDDATA3_S50C0_LENGTH                   0x00000001

#define _LCDDATA3_S51C0_POSITION                 0x00000003
#define _LCDDATA3_S51C0_MASK                     0x00000008
#define _LCDDATA3_S51C0_LENGTH                   0x00000001

#define _LCDDATA3_S52C0_POSITION                 0x00000004
#define _LCDDATA3_S52C0_MASK                     0x00000010
#define _LCDDATA3_S52C0_LENGTH                   0x00000001

#define _LCDDATA3_S53C0_POSITION                 0x00000005
#define _LCDDATA3_S53C0_MASK                     0x00000020
#define _LCDDATA3_S53C0_LENGTH                   0x00000001

#define _LCDDATA3_S54C0_POSITION                 0x00000006
#define _LCDDATA3_S54C0_MASK                     0x00000040
#define _LCDDATA3_S54C0_LENGTH                   0x00000001

#define _LCDDATA3_S55C0_POSITION                 0x00000007
#define _LCDDATA3_S55C0_MASK                     0x00000080
#define _LCDDATA3_S55C0_LENGTH                   0x00000001

#define _LCDDATA3_S56C0_POSITION                 0x00000008
#define _LCDDATA3_S56C0_MASK                     0x00000100
#define _LCDDATA3_S56C0_LENGTH                   0x00000001

#define _LCDDATA3_S57C0_POSITION                 0x00000009
#define _LCDDATA3_S57C0_MASK                     0x00000200
#define _LCDDATA3_S57C0_LENGTH                   0x00000001

#define _LCDDATA3_S58C0_POSITION                 0x0000000A
#define _LCDDATA3_S58C0_MASK                     0x00000400
#define _LCDDATA3_S58C0_LENGTH                   0x00000001

#define _LCDDATA3_S59C0_POSITION                 0x0000000B
#define _LCDDATA3_S59C0_MASK                     0x00000800
#define _LCDDATA3_S59C0_LENGTH                   0x00000001

#define _LCDDATA3_S60C0_POSITION                 0x0000000C
#define _LCDDATA3_S60C0_MASK                     0x00001000
#define _LCDDATA3_S60C0_LENGTH                   0x00000001

#define _LCDDATA3_S61C0_POSITION                 0x0000000D
#define _LCDDATA3_S61C0_MASK                     0x00002000
#define _LCDDATA3_S61C0_LENGTH                   0x00000001

#define _LCDDATA3_S62C0_POSITION                 0x0000000E
#define _LCDDATA3_S62C0_MASK                     0x00004000
#define _LCDDATA3_S62C0_LENGTH                   0x00000001

#define _LCDDATA3_S63C0_POSITION                 0x0000000F
#define _LCDDATA3_S63C0_MASK                     0x00008000
#define _LCDDATA3_S63C0_LENGTH                   0x00000001

#define _LCDDATA4_S00C1_POSITION                 0x00000000
#define _LCDDATA4_S00C1_MASK                     0x00000001
#define _LCDDATA4_S00C1_LENGTH                   0x00000001

#define _LCDDATA4_S01C1_POSITION                 0x00000001
#define _LCDDATA4_S01C1_MASK                     0x00000002
#define _LCDDATA4_S01C1_LENGTH                   0x00000001

#define _LCDDATA4_S02C1_POSITION                 0x00000002
#define _LCDDATA4_S02C1_MASK                     0x00000004
#define _LCDDATA4_S02C1_LENGTH                   0x00000001

#define _LCDDATA4_S03C1_POSITION                 0x00000003
#define _LCDDATA4_S03C1_MASK                     0x00000008
#define _LCDDATA4_S03C1_LENGTH                   0x00000001

#define _LCDDATA4_S04C1_POSITION                 0x00000004
#define _LCDDATA4_S04C1_MASK                     0x00000010
#define _LCDDATA4_S04C1_LENGTH                   0x00000001

#define _LCDDATA4_S05C1_POSITION                 0x00000005
#define _LCDDATA4_S05C1_MASK                     0x00000020
#define _LCDDATA4_S05C1_LENGTH                   0x00000001

#define _LCDDATA4_S06C1_POSITION                 0x00000006
#define _LCDDATA4_S06C1_MASK                     0x00000040
#define _LCDDATA4_S06C1_LENGTH                   0x00000001

#define _LCDDATA4_S07C1_POSITION                 0x00000007
#define _LCDDATA4_S07C1_MASK                     0x00000080
#define _LCDDATA4_S07C1_LENGTH                   0x00000001

#define _LCDDATA4_S08C1_POSITION                 0x00000008
#define _LCDDATA4_S08C1_MASK                     0x00000100
#define _LCDDATA4_S08C1_LENGTH                   0x00000001

#define _LCDDATA4_S09C1_POSITION                 0x00000009
#define _LCDDATA4_S09C1_MASK                     0x00000200
#define _LCDDATA4_S09C1_LENGTH                   0x00000001

#define _LCDDATA4_S10C1_POSITION                 0x0000000A
#define _LCDDATA4_S10C1_MASK                     0x00000400
#define _LCDDATA4_S10C1_LENGTH                   0x00000001

#define _LCDDATA4_S11C1_POSITION                 0x0000000B
#define _LCDDATA4_S11C1_MASK                     0x00000800
#define _LCDDATA4_S11C1_LENGTH                   0x00000001

#define _LCDDATA4_S12C1_POSITION                 0x0000000C
#define _LCDDATA4_S12C1_MASK                     0x00001000
#define _LCDDATA4_S12C1_LENGTH                   0x00000001

#define _LCDDATA4_S13C1_POSITION                 0x0000000D
#define _LCDDATA4_S13C1_MASK                     0x00002000
#define _LCDDATA4_S13C1_LENGTH                   0x00000001

#define _LCDDATA4_S14C1_POSITION                 0x0000000E
#define _LCDDATA4_S14C1_MASK                     0x00004000
#define _LCDDATA4_S14C1_LENGTH                   0x00000001

#define _LCDDATA4_S15C1_POSITION                 0x0000000F
#define _LCDDATA4_S15C1_MASK                     0x00008000
#define _LCDDATA4_S15C1_LENGTH                   0x00000001

#define _LCDDATA5_S16C1_POSITION                 0x00000000
#define _LCDDATA5_S16C1_MASK                     0x00000001
#define _LCDDATA5_S16C1_LENGTH                   0x00000001

